# 미니 프로젝트
1. 주어진 데이터를 보고 데이터 프레임을 생성하고 데이터 프레임 출력하기
2. DataFrame() 함수를 사용하고 지점명을 인덱스로 설정하여 변수 df에 저장하기
3. loc 인덱서를 사용하여 서울지점의 행 데이터만 선택하여 출력하기
4. iloc 인덱서를 사용하여 부산지점의 행 데이터만 선택하여 출력하기
5. 기타는 프로그램 실행 결과 화면 참조

In [6]:
!pip install numpy

Requirement already satisfied: numpy in c:\users\user\anaconda3\lib\site-packages (1.20.1)

In [7]:
import pandas as pd

In [25]:
bio_data = {'컴퓨터':[869, 578, 321], 
            '모니터':[374, 286, 148], 
            '노트북':[569, 427, 335],
            '스마트폰':[197, 89, 66]}

df = pd.DataFrame(bio_data, index=['서울지점', '부산지점', '제주지점'])

print(df)      
print('\n')
display(df)    # 예쁘게 나온다, display 형태로 출력하려면 범위를 지정해줘야한다.

      컴퓨터  모니터  노트북  스마트폰
서울지점  869  374  569   197
부산지점  578  286  427    89
제주지점  321  148  335    66

      컴퓨터  모니터  노트북  스마트폰
서울지점  869  374  569   197
부산지점  578  286  427    89
제주지점  321  148  335    66

In [26]:
df.loc[['서울지점']]

      컴퓨터  모니터  노트북  스마트폰
서울지점  869  374  569   197

In [17]:
df.iloc[[1]]

      컴퓨터  모니터  노트북  스마트폰
부산지점  578  286  427    89

In [20]:
df.iloc[[2]]

      컴퓨터  모니터  노트북  스마트폰
제주지점  321  148  335    66

In [28]:
hw_data = {'컴퓨터':[869, 578, 321], '모니터':[374, 286, 148], 
           '노트북':[569, 427, 335], '스마트폰':[197, 89, 66]}

# DataFrame() 함수를 사용하고 지점명 인덱스로 
df = pd.DataFrame(hw_data, index=['서울지점', '부산지점', '제주지점'])

# 데이터 프레임 df 출력
print(df)
print('\n')

print('>> loc 인덱서로 서울지점의 행 데이터 출력')
search_01 = df.loc['서울지점']
print(search_01)
print('\n')

print('>> loc 인덱서로 제주지점의 행 데이터 출력')
search_02 = df.iloc[2]
print(search_02)
print('\n')

      컴퓨터  모니터  노트북  스마트폰
서울지점  869  374  569   197
부산지점  578  286  427    89
제주지점  321  148  335    66


>> loc 인덱서로 서울지점의 행 데이터 출력
컴퓨터     869
모니터     374
노트북     569
스마트폰    197
Name: 서울지점, dtype: int64


>> loc 인덱서로 제주지점의 행 데이터 출력
컴퓨터     321
모니터     148
노트북     335
스마트폰     66
Name: 제주지점, dtype: int64

## 열 데이터 선택
### 특정 열 데이터만 선택하기
- 데이터 프레임에서 '성명' 열데이터와 '나이' 열 데이터만 각각 따로 선택하여 출력되는 과정을 표현

In [39]:
df =pd.DataFrame([['이겨레', 25, '남', 185, 89],
                  ['조약돌', 19, '여', 163, 53]],
                  index = ['이겨레', '조약돌'],  
                  columns = ['성명', '나이', '성별', '키', '체중'])

display(df)

      성명  나이 성별    키  체중
이겨레  이겨레  25  남  185  89
조약돌  조약돌  19  여  163  53

<class 'pandas.core.frame.DataFrame'>

In [41]:
# 강사님 버전

bio_data = {'성명' : ['이겨레', '조약돌'],
            '나이':[25, 19], '성별':['남', '여'], 
            '키':[185, 163], '체중':[89, 53]}

# DataFrame()함수를 사용하고 성멸을 인덱스로 설정하여 변수 df 에 저장
df = pd.DataFrame(bio_data)

print(df)       # 데이터 프레임 df 출력
print('\n')

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [45]:
# 대괄호로 '성명' 열 데이터 선택
name_01 = df['성명']     #'성명' 열 데이터만 선택
print(name_01) 
print(type(name_01))
print('\n')

# 도트(.)로 '나이' 열 데이터 선택
age_01 = df.나이         #'나이' 열 데이터만 선택
print(age_01)
print(type(age_01))

0    이겨레
1    조약돌
Name: 성명, dtype: object
<class 'pandas.core.series.Series'>


0    25
1    19
Name: 나이, dtype: int64
<class 'pandas.core.series.Series'>

### 특졍 열 데이터 2개 이상 선택하기

In [52]:
bio_data = {'성명' : ['이겨레', '조약돌'],
            '나이':[25, 19], '성별':['남', '여'], 
            '키':[185, 163], '체중':[89, 53]}

df = pd.DataFrame(bio_data)

print(df)      
print('\n')

# 성명, 키, 체중 출력
d1 = df[['성명', '키', '체중']]
print(d1)
print('\n')

# 나이 출력
d2 = df[['나이']]
print(d2)

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53


    성명    키  체중
0  이겨레  185  89
1  조약돌  163  53


   나이
0  25
1  19

In [55]:
# 강사님 버전
# 이중 대괄호로 '성명', '키', '체중' 열 데이터만 선택
name_02 = df[['성명', '키', '체중']]
print(name_02)
print(type(name_02))
print('\n')

#이중 대괄호를 사용하여 '나이'를 시리즈가 아닌 데이터 프레임으로 반환
age_02 = df[['나이']]
print(age_02)
print(type(age_02))

    성명    키  체중
0  이겨레  185  89
1  조약돌  163  53
<class 'pandas.core.frame.DataFrame'>


   나이
0  25
1  19
<class 'pandas.core.frame.DataFrame'>

## 예제 실습
1. 주어진 데이터를 보고 데이터 프레임을 생성하고 데이터 프레임 출력하기
2. 도트(.)를 사용하여 지점명에 대한 1개의 열 데이터만 선택하여 출력하기
3. 대괄호([])를 사용하여 지점명과 노트북에 대한 2개의 열 데이터만 선택하여 출력하기
4. 기타는 프로그램 실행 결과 화면 참조

In [75]:
hw_data = {'지점명' : ['서울지점', '부산지점', '제주지점'],
           '컴퓨터':[869, 578, 321], '모니터':[374, 286, 148], 
           '노트북':[569, 427, 335], '스마트폰':[197, 89, 66]}

df = pd.DataFrame(hw_data)
df

    지점명  컴퓨터  모니터  노트북  스마트폰
0  서울지점  869  374  569   197
1  부산지점  578  286  427    89
2  제주지점  321  148  335    66

In [76]:
# 도트(.) 사용하여 1개 열데이터만 출력
h1 = df['지점명']
h1

0    서울지점
1    부산지점
2    제주지점
Name: 지점명, dtype: object

In [78]:
df.지점명

0    서울지점
1    부산지점
2    제주지점
Name: 지점명, dtype: object

In [79]:
# 지점명, 노트북 출력
h2 = df[['지점명', '노트북']]
h2

    지점명  노트북
0  서울지점  569
1  부산지점  427
2  제주지점  335

In [81]:
# 강사님 버전
hw_data = {'지점명' : ['서울지점', '부산지점', '제주지점'],
           '컴퓨터':[869, 578, 321], '모니터':[374, 286, 148], 
           '노트북':[569, 427, 335], '스마트폰':[197, 89, 66]}

# DataFrame() 함수를 사용하여 데이터 프레임을 변환하고 변수 df에 저장
df = pd.DataFrame(hw_data)

print(df)
print('\n')

print('>>도트(.)를 사용하여 지점명에 대한 1개 열 데잍만 출력')
search_01 = df.지점명
print(search_01)
print(type(search_01))
print('\n')

print('>> 대괄호를 사용하여 지점명과 노트북에 대한 2개 열 데이터만 출력')
search_02 = df.iloc[2]
print(search_02)
print(type(search_02))

    지점명  컴퓨터  모니터  노트북  스마트폰
0  서울지점  869  374  569   197
1  부산지점  578  286  427    89
2  제주지점  321  148  335    66


>>도트(.)를 사용하여 지점명에 대한 1개 열 데잍만 출력
0    서울지점
1    부산지점
2    제주지점
Name: 지점명, dtype: object
<class 'pandas.core.series.Series'>


>> 대괄호를 사용하여 지점명과 노트북에 대한 2개 열 데이터만 출력
지점명     제주지점
컴퓨터      321
모니터      148
노트북      335
스마트폰      66
Name: 2, dtype: object
<class 'pandas.core.series.Series'>

### 열 추가하기

In [91]:
# 데이터 프레임에 새로운 열 추가
# 새로 추가하는 열 데이터의 값을 모두 0으로 대입

bio_data = {'성명' : ['이겨레', '조약돌'],
            '나이':[25, 19], '성별':['남', '여'], 
            '키':[185, 163], '체중':[89, 53]}

df = pd.DataFrame(bio_data)
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [92]:
# 새로운 'BMI' 열 추가하고 공통된 데이터 값은 모두 0으로 대입

df['BMI'] = 0
df

    성명  나이 성별    키  체중  BMI
0  이겨레  25  남  185  89    0
1  조약돌  19  여  163  53    0

In [93]:
# 데이터 프레임에 행을 추가하는 방법

#2
df.loc[2] = 0
df

    성명  나이 성별    키  체중  BMI
0  이겨레  25  남  185  89    0
1  조약돌  19  여  163  53    0
2    0   0  0    0   0    0

In [95]:
#4

df.loc[3] = ['강산에', 27, '남', 177, 63, 0]
df

    성명  나이 성별    키  체중  BMI
0  이겨레  25  남  185  89    0
1  조약돌  19  여  163  53    0
2    0   0  0    0   0    0
3  강산에  27  남  177  63    0

### 단독 원소 선택하기

In [121]:
# 단독 원소를 선택하는 2가지 방법

bio_data = {'성명' : ['이겨레', '조약돌'],
            '나이':[25, 19], '성별':['남', '여'], 
            '키':[185, 163], '체중':[89, 53]}

df = pd.DataFrame(bio_data)
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [122]:
# 단독 원소 선택하는 방법

df.set_index('성명', inplace=True)
df

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  53

In [125]:
# 행과 열 이름 지정 : df.loc['행이름', '열이름']

df.loc['이겨레', '키']
df

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  53

In [126]:
# 행과 열 좌표 지정

df.iloc[[0,1]]

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  53

In [127]:
# 강사님 버전 1

target_01 = df.loc['이겨레', '키']
target_01

185

In [128]:
# 강사님 버전 2

target_02 = df.iloc[0, 2]
target_02

185

### 여러 개의 원소 선택하기

In [156]:
bio_data = {'성명' : ['이겨레', '조약돌'],
            '나이':[25, 19], '성별':['남', '여'], 
            '키':[185, 163], '체중':[89, 53]}

df = pd.DataFrame(bio_data)
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [157]:
d1 = df.set_index('성명', inplace=True)
print(d1)
print('\n')

d2 = df.iloc[0, [2, 3]]
print(d2)

None


키     185
체중     89
Name: 이겨레, dtype: object

In [161]:
# 데이터 프레임에서 2행 2열의 복수 개 특정 원소 선택 1

d3 = df.iloc[[0,1], [2,3]]
d3

       키  체중
성명
이겨레  185  89
조약돌  163  53

In [163]:
# 데이터 프레임에서 2행 2열의 복수 개 특정 원소 선택 2

df. iloc[0:2, 2:]
df

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  53

In [165]:
# 강사님 버전
# 데이터 프레임에서 2행 2열의 복수 개 특정 원소 선택 3

df.loc[['이겨레', '조약돌'], ['키', '체중']]
df

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  53

### 열의 원소값 변경하기

In [172]:
bio_data = {'성명' : ['이겨레', '조약돌'],
            '나이':[25, 19], '성별':['남', '여'], 
            '키':[185, 163], '체중':[89, 53]}

df = pd.DataFrame(bio_data)
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [173]:
# '성명' 열을 행 인덱스로 지정하고 새로운 열을 추가하기 전 데이터 프레임 출력
df.set_index('성명', inplace=True)
print(df)

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  53

In [180]:
# 새로운 'BMI' 열을 추가하고 공통된 데이터 값은 모두 0으로 
df.loc['BMI'] = 0
df

     나이 성별    키  체중    BMI
성명
이겨레  25  남  185  89  26.00
조약돌  19  여  163  53  19.95
BMI   0  0    0   0   0.00

In [182]:
# 'BMI' 열의 원소값을 인덱싱과 슬라이싱 기법으로 변경
df.loc['이겨레', 'BMI'] = 26.00     # 'BMI' 열의 원소값을 슬라이싱 기법으로 변경 
df.iloc[1, 4] = 19.95               # 'BMI' 열의 원소값을 인덱싱으로 변경
print(df)

     나이 성별    키  체중    BMI
성명
이겨레  25  남  185  89  26.00
조약돌  19  여  163  53  19.95
BMI   0  0    0   0   0.00

### 행의 원소값 변경하기

In [183]:
bio_data = {'성명' : ['이겨레', '조약돌'],
            '나이':[25, 19], '성별':['남', '여'], 
            '키':[185, 163], '체중':[89, 53]}

df = pd.DataFrame(bio_data)
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [184]:
df.set_index('성명', inplace=True)
df

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  53

In [187]:
# 데이터 프레임에서 특정 행의 원소값 변경

df.loc['강산애', '나이' : '체중'] = 27, '남', 177, 63
df

       나이 성별      키    체중
성명
이겨레  25.0  남  185.0  89.0
조약돌  19.0  여  163.0  53.0
강산애  27.0  남  177.0  63.0

In [188]:
df.iloc[2, 0:4] = 27, '남', 177, 63
df

       나이 성별      키    체중
성명
이겨레  25.0  남  185.0  89.0
조약돌  19.0  여  163.0  53.0
강산애  27.0  남  177.0  63.0

# 미니 프로젝트
1. 주어진 데이터를 보고 데이터 프레임을 생성하고 데이터 프레임 출력하기
2. set_index()메소드를 사용하여 지점명 열을 행 인덱스로 지정하기
3. 스마트폰 열을 추가하고 모두 0의 값으로 초기화하여 데이터 프레임 출력하기
4. 스마트폰 열의 데이터를 다음에 주어진 값으로 변경하고 데이터 프레임 출력하기
5. loc 인덱서를 사용하여 서울지점의 스마트폰 데이터를 변경하고 데이터 프레임 출력하기
6. iloc 인덱서를 사용하여 제주지점의 스마트폰 데이터를 변경하고 데이터 프레임 출력하기
7. 기타는 프로그램 실행 결과 화면 참조

In [200]:
hw_data = {'지점명' : ['서울지점', '제주지점'],
           '컴퓨터':[869, 321], '모니터':[374, 148], 
           '노트북':[569, 335], '스마트폰':[197, 66]}

df = pd.DataFrame(hw_data)
df

    지점명  컴퓨터  모니터  노트북  스마트폰
0  서울지점  869  374  569   197
1  제주지점  321  148  335    66

In [201]:
# set_index()메소드를 사용하여 지점명 열을 행 인덱스로 지정하기

df.set_index('지점명', inplace=True)
df

      컴퓨터  모니터  노트북  스마트폰
지점명
서울지점  869  374  569   197
제주지점  321  148  335    66

In [202]:
# 스마트폰 열을 추가하고 모두 0의 값으로 초기화하여 데이터 프레임 출력하기

df['스마트폰'] = 0
df

      컴퓨터  모니터  노트북  스마트폰
지점명
서울지점  869  374  569     0
제주지점  321  148  335     0

In [210]:
# 스마트폰 열의 데이터를 다음에 주어진 값으로 변경하고 데이터 프레임 출력하기

df.loc['서울지점', '스마트폰'] = 197
df.loc['제주지점', '스마트폰'] = 66
df

      컴퓨터  모니터  노트북  스마트폰
지점명
서울지점  869  374  569   197
제주지점  321  148  335    66

In [211]:
# loc 인덱서를 사용하여 서울지점의 스마트폰 데이터를 변경하고 데이터 프레임 출력하기

df.loc['서울지점', '스마트폰'] = 100
df

      컴퓨터  모니터  노트북  스마트폰
지점명
서울지점  869  374  569   100
제주지점  321  148  335    66

In [213]:
# iloc 인덱서를 사용하여 제주지점의 스마트폰 데이터를 변경하고 데이터 프레임 출력하기

df.iloc[1, 3] = 50
df

      컴퓨터  모니터  노트북  스마트폰
지점명
서울지점  869  374  569   100
제주지점  321  148  335    50